---
type: FaceDetailNode
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# FaceDetailNode

`Autodesk.Revit.DB.FaceDetailNode` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetInstanceTransform | 2020 | `public Transform GetInstanceTransform ()` |
| Method | GetLinkTransform | 2020 | `public Transform GetLinkTransform ()` |
| Property | LineProperties | 2020 | `public LineProperties LineProperties { get ; }` |